ah ok. Got you now. For me this worked in:


```
locals {
  namespace     = "olm"
  chart_version = "0.28.0"
}

resource "helm_release" "this" {
  name       = local.namespace
  namespace  = local.namespace

  repository = "oci://ghcr.io/cloudtooling/helm-charts"
  chart      = "olm"
  create_namespace = true
  version    = local.chart_version
  set {
    name = "catalog_namespace"
    value = "olm"
  }

  wait       = true
}

```

```

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "olm"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "olm"
      + namespace                  = "olm"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/cloudtooling/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.28.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "catalog_namespace"
          + value = "olm"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

helm_release.this: Creating...
helm_release.this: Still creating... [10s elapsed]
helm_release.this: Creation complete after 16s [id=olm]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```